# DuplicateTypeNamesHandlerArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuplicateTypeNamesHandlerArgs Class
Members See Also
---
A structure that provides information about an attempt to copy types with names that already exist in the destination document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuplicateTypeNamesHandlerArgs : IDisposable
```

Visual Basic
---
```text
Public Class DuplicateTypeNamesHandlerArgs _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuplicateTypeNamesHandlerArgs : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DuplicateTypeNamesHandlerArgs
# See Also
DuplicateTypeNamesHandlerArgs Members
Autodesk.Revit.DB Namespace